# трасса
TRACK_COLOR = (150, 150, 150)
TRACK = [[95, 114], [237, 64], [385, 48], [532, 86], [613, 100], [756, 85], [891, 75], [1081, 51], [1141, 144],
         [1134, 237], [1089, 315], [1035, 400], [967, 409], [871, 430], [819, 457], [869, 533], [938, 622], [918, 694],
         [722, 740], [556, 742], [450, 748], [421, 654], [331, 623], [215, 618], [172, 665], [97, 683], [57, 572],
         [79, 390], [63, 300], [47, 222], [96, 114]]
TRACK2 = [[298, 190], [408, 197], [486, 249], [570, 287], [692, 254], [849, 222], [920, 226], [924, 243], [892, 303],
          [808, 330], [737, 358], [714, 401], [667, 440], [669, 506], [689, 559], [746, 601], [635, 619], [565, 600],
          [497, 551], [473, 502], [389, 478], [284, 477], [229, 481], [179, 415], [202, 312], [201, 215]]

START_LINE = ([45, 456], [226, 456])

CHECKPOINTS = [([200, 50], [246, 231]), ([513, 64], [464, 272]), ([829, 83], [843, 243]), ([879, 278], [1027, 416]),
               ([919, 545], [688, 584]), ([603, 585], [544, 774])]
NEURON_RADIUS = 6

# Константы
FORCE = 0.5  # Сила для ускорения
MAX_SPEED = 10
MAX_SPEED_REVERS = 3
DECELERATION = 0.05
GRIP = 0.01  # Коэффициент сцепления для дрифта
DRIFT_FACTOR = 0.2  # Коэффициент дрифта
BLACK = (0, 0, 0)
SCREEN_WIDTH, SCREEN_HEIGHT = 1200, 800
FPS = 60
CAR_WIDTH, CAR_HEIGHT = 25, 55
WHITE = (255, 255, 255)
GRAY = (100, 100, 100)
RED = (200, 0, 0)
TIMEOUT = 10
MAX_TIMEOUT = 90
VIS_WIDTH = 500
VIS_HEIGHT = 250
VIS_X = SCREEN_WIDTH - VIS_WIDTH
VIS_Y = SCREEN_HEIGHT - VIS_HEIGHT

# Определите, сколько геномов вы хотите визуализировать
GROUP_SIZE = 10

CHECKPOINT_DIR = 'checkpoints'
